// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "Actualizar firmware";

// Errors
FileOpenError = "No se puede abrir el archivo %@";
FileOpenErrorExplanation = "Este archivo está dañado o es posible que fue trasladado a otra ubicación, eliminado o que se le cambió el nombre. Verifique la ubicación del archivo o seleccione otro archivo e inténtelo nuevamente.";
PrintChannelOpenError = "No se puede abrir un canal de impresora";
PrintChannelOpenErrorExplanation = "Verifique que la impresora esté conectada y encendida, e inténtelo nuevamente.";
SendDataError = "No se pueden enviar los datos a la impresora";
SendDataErrorExplanation = "Verifique que la impresora esté conectada y encendida, e inténtelo nuevamente.";

SomePenErrorTitle = "No se puede actualizar el firmware";
DoorOpenMsg = "No se puede actualizar el firmware porque la cubierta está abierta. Cierre todas las cubiertas de la impresora.";

// Aquamarine Errors
FileCheckError = "No se puede actualizar el firmware";
FileCheckErrorExplanation = "El paquete de firmware no es válico. Seleccione otro archivo e inténtelo nuevamente.";

OkButton = "OK";
CancelButton = "Cancelar";
FirmwareUpdateTitle = "Actualizar firmware";
FirmwareUpdateDeviceState = "Imprimiendo";
FirmwareUpdateCancelingDeviceState = "Cancelando";

// Great Wall Messages
PrinterIdleWarning = "La actualización del firmware puede fallar si la impresora está ocupada (por ejemplo, imprimiendo un trabajo o efectuando la calibración).\n\nAntes de proceder con el proceso de actualización del firmware, asegúrese de que la impresora no esté ocupada.";
UpdateSuccessful = "El archivo de firmware ha sido cargado satisfactoriamente y la impresora se va a actualizar próximamente.\n\nUna vez finalizada la actualización del firmware, la impresora se reiniciará automáticamente.";
InvalidPackage = "Hubo problemas con el archivo de firmware y no se ha podido completar la actualización del firmware. Es posible que el problema fue causado por un error de transmisión.\n\nIntente ejecutar nuevamente la actualización del firmware.\nSi el problema continúa, póngase en contacto con HP Support.";
FailedDependencies = "No se pudo completar satisfactoriamente el proceso de actualización del firmware debido a problemas de dependencias.\n\nLa versión actual del firmware es %@, y usted está intentando instalar %@.\n\nVisite la siguiente página Web para encontrar el paquete de actualización que corresponde a esta impresora:\n%@.";
NotNow = "No se pudo completar satisfactoriamente el proceso de actualización del firmware porque la impresora está ocupada (por ejemplo, procesando o imprimiendo un trabajo).\n\nAsegúrese de que la impresora no esté ocupada, e intente nuevamente la actualización del firmware.";
TransmissionError = "Hubo problemas de transmisión que impidieron la actualización del firmware.\n\nVerifique la conexión de la impresora e intente nuevamente actualizar el firmware.";
LicenseNotAccepted = "No se completó la actualización del firmware porque no se ha aceptado la licencia.";
FatalError = "Hubo problemas que impidieron la actualización del firmware.\n\nSi el problema continúa, póngase en contacto con HP Support.";

// layout
TaskTitle = "Actualizar firmware";
TaskDescription = "Seleccione un archivo que contenga una actualización de firmware y transfiéralo a la impresora para actualizarla.";
FileNameTitle = "Nombre del archivo:";
FileNameField = "<No seleccionado>";
ChooseButton = "Seleccionar…";
UpdateButton = "Actualización";
ProgressPanel = "Progreso de la actualización";
FirmwareUpdateProcessTitle = "Actualizando…";
